Tekla Open API Reference for Tekla Structures 2025
MeshItem.Select Method
 Selects the mesh item in the mesh database.
 Namespace: Tekla.Structures.Catalogs
 Assembly: Tekla.Structures.Catalogs (in Tekla.Structures.Catalogs.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public bool Select(
	string MeshName,
	string MeshGrade
)
Public Function Select (
	MeshName As String,
	MeshGrade As String
) As Boolean
Parameters
MeshName
Type: System.String
The name of the mesh item to select.
MeshGrade
Type: System.String
The grade of the mesh item to select.
Return Value
Type: Boolean
True on success.
See Also
Reference
MeshItem Class
Tekla.Structures.Catalogs Namespace